Table of Contents
 Class RigidLink
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Rigid link between nodes
[OpenModelClass("CI.StructModel.Structure.RigidLink,CI.StructuralElements", "CI.StructModel.Structure.IRigidLink,CI.BasicTypes")]
public class RigidLink : OpenElementId
Inheritance
object
OpenObject
OpenElementId
RigidLink
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 RigidLink()
Constructor
public RigidLink()
Properties
 MasterNode
Node to which all six independent degrees of freedom for the element are assigned
public ReferenceElement MasterNode { get; set; }
Property Value
ReferenceElement
 RigidRX
DOF rigid in RX dirrection
public bool RigidRX { get; set; }
Property Value
bool
 RigidRY
DOF rigid in RY dirrection
public bool RigidRY { get; set; }
Property Value
bool
 RigidRZ
DOF rigid in RZ dirrection
public bool RigidRZ { get; set; }
Property Value
bool
 RigidX
DOF rigid in X dirrection
public bool RigidX { get; set; }
Property Value
bool
 RigidZ
DOF rigid in Z dirrection
public bool RigidZ { get; set; }
Property Value
bool
 SlaveNodes
Dependent nodes
public List<ReferenceElement> SlaveNodes { get; set; }
Property Value
List<ReferenceElement>
 Edit this page